# 5. DataFrame 연습하기

In [92]:
import numpy as np 
import pandas as pd

## 5-1. 데이터 가져오기

In [95]:
d = pd.read_csv('../data/korean-idol.csv')
d

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
0     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
1   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
2   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
3      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
4     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
5     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
6     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
7     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
8      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
9    하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
10    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
11   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
12    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
13    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
14    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

# 5-2. 데이터 살펴보기

In [98]:
d.shape

(15, 8)

In [101]:
d.head(5)

     이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
0    지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
1  지드래곤     빅뱅   YG  남자  1988-08-18  177.0   A   9916947
2  강다니엘    NaN  커넥트  남자  1996-12-10  180.0   A   8273745
3     뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
4    화사    마마무  RBW  여자  1995-07-23  162.1   A   7650928

In [104]:
d.tail()

     이름     그룹   소속사  성별        생년월일      키 혈액형   브랜드평판지수
11  차은우   아스트로  판타지오  남자  1997-03-30  183.0   B   3506027
12   백호   뉴이스트  플레디스  남자  1995-07-21  175.0  AB   3301654
13   JR   뉴이스트  플레디스  남자  1995-06-08  176.0   O   3274137
14   슈가  방탄소년단   빅히트  남자  1993-03-09  174.0   O   2925442
16  아이유    NaN  EDAM  여자  1993-05-16  161.8   O  12345678

In [107]:
d.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15 entries, 0 to 14
Data columns (total 8 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   이름       15 non-null     object
 1   그룹       14 non-null     object
 2   소속사      15 non-null     object
 3   성별       15 non-null     object
 4   생년월일     15 non-null     object
 5   키        13 non-null     float64
 6   혈액형      15 non-null     object
 7   브랜드평판지수  15 non-null     int64
dtypes: float64(1), int64(1), object(6)
memory usage: 1.1+ KB

In [109]:
d.describe()

                키       브랜드평판지수
count   13.000000  1.500000e+01
mean   175.792308  5.655856e+06
std      5.820576  2.539068e+06
min    162.100000  2.925442e+06
25%    174.000000  3.712344e+06
50%    177.000000  4.668615e+06
75%    179.200000  7.862214e+06
max    183.000000  1.052326e+07

In [111]:
# 행 인덱스 증가
d.index += 1
d

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
1     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
2   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
3   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
4      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
5     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
6     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
7     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
8     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
9      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
10   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
11    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
12   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
13    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
14    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
15    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

## 5-3; 데이터 인덱싱, 슬라이싱

In [113]:
# 열 인덱싱
d['이름']

1       지민
2     지드래곤
3     강다니엘
4        뷔
5       화사
6       정국
7       민현
8       소연
9        진
10     하성운
11      태연
12     차은우
13      백호
14      JR
15      슈가
Name: 이름, dtype: object

In [115]:
d.이름

1       지민
2     지드래곤
3     강다니엘
4        뷔
5       화사
6       정국
7       민현
8       소연
9        진
10     하성운
11      태연
12     차은우
13      백호
14      JR
15      슈가
Name: 이름, dtype: object

In [117]:
d.loc[:,'이름']

1       지민
2     지드래곤
3     강다니엘
4        뷔
5       화사
6       정국
7       민현
8       소연
9        진
10     하성운
11      태연
12     차은우
13      백호
14      JR
15      슈가
Name: 이름, dtype: object

In [119]:
d.iloc[:,0]

1       지민
2     지드래곤
3     강다니엘
4        뷔
5       화사
6       정국
7       민현
8       소연
9        진
10     하성운
11      태연
12     차은우
13      백호
14      JR
15      슈가
Name: 이름, dtype: object

In [121]:
d.loc[:,'이름':'그룹']

      이름     그룹
1     지민  방탄소년단
2   지드래곤     빅뱅
3   강다니엘    NaN
4      뷔  방탄소년단
5     화사    마마무
6     정국  방탄소년단
7     민현   뉴이스트
8     소연    아이들
9      진  방탄소년단
10   하성운     핫샷
11    태연   소녀시대
12   차은우   아스트로
13    백호   뉴이스트
14    JR   뉴이스트
15    슈가  방탄소년단

In [123]:
d.iloc[:,0:2]

      이름     그룹
1     지민  방탄소년단
2   지드래곤     빅뱅
3   강다니엘    NaN
4      뷔  방탄소년단
5     화사    마마무
6     정국  방탄소년단
7     민현   뉴이스트
8     소연    아이들
9      진  방탄소년단
10   하성운     핫샷
11    태연   소녀시대
12   차은우   아스트로
13    백호   뉴이스트
14    JR   뉴이스트
15    슈가  방탄소년단

In [125]:
d[['이름','그룹']]

      이름     그룹
1     지민  방탄소년단
2   지드래곤     빅뱅
3   강다니엘    NaN
4      뷔  방탄소년단
5     화사    마마무
6     정국  방탄소년단
7     민현   뉴이스트
8     소연    아이들
9      진  방탄소년단
10   하성운     핫샷
11    태연   소녀시대
12   차은우   아스트로
13    백호   뉴이스트
14    JR   뉴이스트
15    슈가  방탄소년단

In [127]:
# 행 인덱싱 (loc, iloc)
d.loc[4]

이름                  뷔
그룹              방탄소년단
소속사               빅히트
성별                 남자
생년월일       1995-12-30
키               178.0
혈액형                AB
브랜드평판지수       8073501
Name: 4, dtype: object

In [129]:
d.iloc[3]

이름                  뷔
그룹              방탄소년단
소속사               빅히트
성별                 남자
생년월일       1995-12-30
키               178.0
혈액형                AB
브랜드평판지수       8073501
Name: 4, dtype: object

In [131]:
d.loc[[4,6]]

   이름     그룹  소속사  성별        생년월일      키 혈액형  브랜드평판지수
4   뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB  8073501
6  정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A  5208335

In [133]:
d.iloc[[3,5]]

   이름     그룹  소속사  성별        생년월일      키 혈액형  브랜드평판지수
4   뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB  8073501
6  정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A  5208335

In [135]:
d.loc[[4,6],['이름','생년월일']]

   이름        생년월일
4   뷔  1995-12-30
6  정국  1997-09-01

In [137]:
d.loc[4:6,'이름':'생년월일']

   이름     그룹  소속사  성별        생년월일
4   뷔  방탄소년단  빅히트  남자  1995-12-30
5  화사    마마무  RBW  여자  1995-07-23
6  정국  방탄소년단  빅히트  남자  1997-09-01

In [138]:
d.iloc[3:6,0:5]

   이름     그룹  소속사  성별        생년월일
4   뷔  방탄소년단  빅히트  남자  1995-12-30
5  화사    마마무  RBW  여자  1995-07-23
6  정국  방탄소년단  빅히트  남자  1997-09-01

In [139]:
# Boolean 인덱싱
# 소속사가 빅히트인 가수 조회하기
d[d['소속사'] == '빅히트']

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

In [140]:
d.loc[d['소속사']=='빅히트']

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

In [141]:
# pandas query
d.query('소속사 == "빅히트"')

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

In [142]:
# 키가 180 이상인 사람 조회하기
d.query('키 >= 180')

      이름    그룹   소속사  성별        생년월일      키 혈액형  브랜드평판지수
3   강다니엘   NaN   커넥트  남자  1996-12-10  180.0   A  8273745
7     민현  뉴이스트  플레디스  남자  1995-08-09  182.3   O  4989792
12   차은우  아스트로  판타지오  남자  1997-03-30  183.0   B  3506027

In [143]:
d.loc[d['키'] >= 180]

      이름    그룹   소속사  성별        생년월일      키 혈액형  브랜드평판지수
3   강다니엘   NaN   커넥트  남자  1996-12-10  180.0   A  8273745
7     민현  뉴이스트  플레디스  남자  1995-08-09  182.3   O  4989792
12   차은우  아스트로  판타지오  남자  1997-03-30  183.0   B  3506027

In [144]:
# 소속사가 빅히트 또는 SM 인 데이터 조회하기
d.loc[(d['소속사'] == '빅히트') | (d['소속사'] == 'SM')]

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
11  태연   소녀시대   SM  여자  1989-03-09    NaN   A   3918661
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

In [145]:
d.query('소속사 == "빅히트" | 소속사 == "SM"') # or 또는 |

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
11  태연   소녀시대   SM  여자  1989-03-09    NaN   A   3918661
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

In [146]:
d.query('소속사 in ("빅히트","SM")')

    이름     그룹  소속사  성별        생년월일      키 혈액형   브랜드평판지수
1   지민  방탄소년단  빅히트  남자  1995-10-13  173.6   A  10523260
4    뷔  방탄소년단  빅히트  남자  1995-12-30  178.0  AB   8073501
6   정국  방탄소년단  빅히트  남자  1997-09-01  178.0   A   5208335
9    진  방탄소년단  빅히트  남자  1992-12-04  179.2   O   4570308
11  태연   소녀시대   SM  여자  1989-03-09    NaN   A   3918661
15  슈가  방탄소년단  빅히트  남자  1993-03-09  174.0   O   2925442

## 5-4. 데이터 CRUD

In [147]:
# 아이유 행 추가
d.loc[16] = ['아이유', np.NaN, 'EDAM', '여자', '1993-05-16', 161.8, 'O', 12345678]
d

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
1     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
2   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
3   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
4      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
5     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
6     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
7     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
8     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
9      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
10   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
11    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
12   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
13    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
14    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
15    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442
16   아이유    NaN     EDAM  여자  1993-05-16  161.8   O  12345678

In [148]:
# 행 삭제
d = d.drop(16)
d

      이름     그룹      소속사  성별        생년월일      키 혈액형   브랜드평판지수
1     지민  방탄소년단      빅히트  남자  1995-10-13  173.6   A  10523260
2   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A   9916947
3   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A   8273745
4      뷔  방탄소년단      빅히트  남자  1995-12-30  178.0  AB   8073501
5     화사    마마무      RBW  여자  1995-07-23  162.1   A   7650928
6     정국  방탄소년단      빅히트  남자  1997-09-01  178.0   A   5208335
7     민현   뉴이스트     플레디스  남자  1995-08-09  182.3   O   4989792
8     소연    아이들       큐브  여자  1998-08-26    NaN   B   4668615
9      진  방탄소년단      빅히트  남자  1992-12-04  179.2   O   4570308
10   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A   4036489
11    태연   소녀시대       SM  여자  1989-03-09    NaN   A   3918661
12   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B   3506027
13    백호   뉴이스트     플레디스  남자  1995-07-21  175.0  AB   3301654
14    JR   뉴이스트     플레디스  남자  1995-06-08  176.0   O   3274137
15    슈가  방탄소년단      빅히트  남자  1993-03-09  174.0   O   2925442

In [153]:
# 소속사가 빅히트인 데이터 삭제하기
d = d.drop(d[d['소속사']=='빅히트'].index)
d

      이름    그룹      소속사  성별        생년월일      키 혈액형  브랜드평판지수
2   지드래곤    빅뱅       YG  남자  1988-08-18  177.0   A  9916947
3   강다니엘   NaN      커넥트  남자  1996-12-10  180.0   A  8273745
5     화사   마마무      RBW  여자  1995-07-23  162.1   A  7650928
7     민현  뉴이스트     플레디스  남자  1995-08-09  182.3   O  4989792
8     소연   아이들       큐브  여자  1998-08-26    NaN   B  4668615
10   하성운    핫샷  스타크루이엔티  남자  1994-03-22  167.1   A  4036489
11    태연  소녀시대       SM  여자  1989-03-09    NaN   A  3918661
12   차은우  아스트로     판타지오  남자  1997-03-30  183.0   B  3506027
13    백호  뉴이스트     플레디스  남자  1995-07-21  175.0  AB  3301654
14    JR  뉴이스트     플레디스  남자  1995-06-08  176.0   O  3274137

In [154]:
# 열 추가
d['국적'] = '대한민국'
d

      이름    그룹      소속사  성별        생년월일      키 혈액형  브랜드평판지수    국적
2   지드래곤    빅뱅       YG  남자  1988-08-18  177.0   A  9916947  대한민국
3   강다니엘   NaN      커넥트  남자  1996-12-10  180.0   A  8273745  대한민국
5     화사   마마무      RBW  여자  1995-07-23  162.1   A  7650928  대한민국
7     민현  뉴이스트     플레디스  남자  1995-08-09  182.3   O  4989792  대한민국
8     소연   아이들       큐브  여자  1998-08-26    NaN   B  4668615  대한민국
10   하성운    핫샷  스타크루이엔티  남자  1994-03-22  167.1   A  4036489  대한민국
11    태연  소녀시대       SM  여자  1989-03-09    NaN   A  3918661  대한민국
12   차은우  아스트로     판타지오  남자  1997-03-30  183.0   B  3506027  대한민국
13    백호  뉴이스트     플레디스  남자  1995-07-21  175.0  AB  3301654  대한민국
14    JR  뉴이스트     플레디스  남자  1995-06-08  176.0   O  3274137  대한민국

In [158]:
# 열 삭제
d = d.drop('국적', axis=1) # d.drop(columns='국적')
d

      이름    그룹      소속사  성별        생년월일      키 혈액형  브랜드평판지수
2   지드래곤    빅뱅       YG  남자  1988-08-18  177.0   A  9916947
3   강다니엘   NaN      커넥트  남자  1996-12-10  180.0   A  8273745
5     화사   마마무      RBW  여자  1995-07-23  162.1   A  7650928
7     민현  뉴이스트     플레디스  남자  1995-08-09  182.3   O  4989792
8     소연   아이들       큐브  여자  1998-08-26    NaN   B  4668615
10   하성운    핫샷  스타크루이엔티  남자  1994-03-22  167.1   A  4036489
11    태연  소녀시대       SM  여자  1989-03-09    NaN   A  3918661
12   차은우  아스트로     판타지오  남자  1997-03-30  183.0   B  3506027
13    백호  뉴이스트     플레디스  남자  1995-07-21  175.0  AB  3301654
14    JR  뉴이스트     플레디스  남자  1995-06-08  176.0   O  3274137

In [163]:
d.loc[d['그룹'] == '뉴이스트','그룹'] = '올드이스트'
d

      이름     그룹      소속사  성별        생년월일      키 혈액형  브랜드평판지수
2   지드래곤     빅뱅       YG  남자  1988-08-18  177.0   A  9916947
3   강다니엘    NaN      커넥트  남자  1996-12-10  180.0   A  8273745
5     화사    마마무      RBW  여자  1995-07-23  162.1   A  7650928
7     민현  올드이스트     플레디스  남자  1995-08-09  182.3   O  4989792
8     소연    아이들       큐브  여자  1998-08-26    NaN   B  4668615
10   하성운     핫샷  스타크루이엔티  남자  1994-03-22  167.1   A  4036489
11    태연   소녀시대       SM  여자  1989-03-09    NaN   A  3918661
12   차은우   아스트로     판타지오  남자  1997-03-30  183.0   B  3506027
13    백호  올드이스트     플레디스  남자  1995-07-21  175.0  AB  3301654
14    JR  올드이스트     플레디스  남자  1995-06-08  176.0   O  3274137